#Methods to  drop or change NaN values

In [0]:
import pandas as pd
import numpy as np

In [0]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [0]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

##If you want to drop Nan

In [6]:
df.dropna()

     A    B  C
0  1.0  5.0  1

Thresh argument creates a threashold for the number of non NaN values

In [10]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

###If we want to replace the NaN values with something else we use the df.fillna()

In [11]:
df.fillna('FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

###This will replace all the NaN of the corrosponding column by its mean

In [14]:
df.fillna(value = df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

###TO replace the value of NaN by specific mean we specify the column

In [16]:
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

### To fill the mean of a specific row we use

In [19]:
df.fillna(value = df.loc[2].mean())
#Note that mean function only takes find mean of the exisiting values

     A    B  C
0  1.0  5.0  1
1  2.0  3.0  2
2  3.0  3.0  3